[
  {
    "name": "Squat",
    "forkId": "Barbell_Squat",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack to just below shoulder level. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.",
      "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.",
      "Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section).",
      "Begin to slowly lower the bar by bending the knees and hips as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees. Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.",
      "Begin to raise the bar as you exhale by pushing the floor with the heel of your foot as you straighten the legs again and go back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Barbell_Squat/0.jpg",
      "Barbell_Squat/1.jpg"
    ]
  },
  {
    "name": "Bent-Arm Pullover",
    "forkId": "Bent-Arm_Dumbbell_Pullover",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "lats",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Place a dumbbell standing up on a flat bench.",
      "Ensuring that the dumbbell stays securely placed at the top of the bench, lie perpendicular to the bench (torso across it as in forming a cross) with only your shoulders lying on the surface. Hips should be below the bench and legs bent with feet firmly on the floor. The head will be off the bench as well.",
      "Grasp the dumbbell with both hands and hold it straight over your chest with a bend in your arms. Both palms should be pressing against the underside one of the sides of the dumbbell. This will be your starting position. Caution: Always ensure that the dumbbell used for this exercise is secure. Using a dumbbell with loose plates can result in the dumbbell falling apart and falling on your face.",
      "While keeping your arms locked in the bent arm position, lower the weight slowly in an arc behind your head while breathing in until you feel a stretch on the chest.",
      "At that point, bring the dumbbell back to the starting position using the arc through which the weight was lowered and exhale as you perform this movement.",
      "Hold the weight on the initial position for a second and repeat the motion for the prescribed number of repetitions."
    ],
    "category": "strength",
    "images": [
      "Bent-Arm_Dumbbell_Pullover/0.jpg",
      "Bent-Arm_Dumbbell_Pullover/1.jpg"
    ]
  },
  {
    "name": "Curl",
    "forkId": "Barbell_Curl",
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "biceps"
    ],
    "secondaryMuscles": [
      "forearms"
    ],
    "instructions": [
      "Stand up with your torso upright while holding a barbell at a shoulder-width grip. The palm of your hands should be facing forward and the elbows should be close to the torso. This will be your starting position.",
      "While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out. Tip: Only the forearms should move.",
      "Continue the movement until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a second and squeeze the biceps hard.",
      "Slowly begin to bring the bar back to starting position as your breathe in.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Barbell_Curl/0.jpg",
      "Barbell_Curl/1.jpg"
    ]
  },
  {
    "name": "Dips - Chest Version",
    "forkId": "Dips_-_Chest_Version",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "other",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "For this exercise you will need access to parallel bars. To get yourself into the starting position, hold your body at arms length (arms locked) above the bars.",
      "While breathing in, lower yourself slowly with your torso leaning forward around 30 degrees or so and your elbows flared out slightly until you feel a slight stretch in the chest.",
      "Once you feel the stretch, use your chest to bring your body back to the starting position as you breathe out. Tip: Remember to squeeze the chest at the top of the movement for a second.",
      "Repeat the movement for the prescribed amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Dips_-_Chest_Version/0.jpg",
      "Dips_-_Chest_Version/1.jpg"
    ]
  },
  {
    "name": "Chest-Supported Row",
    "forkId": null,
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "lats",
      "biceps",
      "traps"
    ],
    "instructions": [
      "Set an incline bench to about 30-45 degrees and lie chest-down on the pad.",
      "Hold a barbell with a shoulder-width overhand grip and let it hang straight down.",
      "Row the bar toward your lower chest while keeping your chest glued to the bench.",
      "Pause briefly at the top, then lower under control to full arm extension."
    ],
    "category": "strength",
    "images": [
      "https://raw.githubusercontent.com/keenfann/free-exercise-db/main/exercises/Lying_Cambered_Barbell_Row/0.jpg",
      "https://raw.githubusercontent.com/keenfann/free-exercise-db/main/exercises/Lying_Cambered_Barbell_Row/1.jpg"
    ]
  },
  {
    "name": "Sit-Up",
    "forkId": "Sit-Up",
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "body only",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Lie down on the floor placing your feet either under something that will not move or by having a partner hold them. Your legs should be bent at the knees.",
      "Place your hands behind your head and lock them together by clasping your fingers. This is the starting position.",
      "Elevate your upper body so that it creates an imaginary V-shape with your thighs. Breathe out when performing this part of the exercise.",
      "Once you feel the contraction for a second, lower your upper body back down to the starting position while inhaling.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Sit-Up/0.jpg",
      "Sit-Up/1.jpg"
    ]
  },
  {
    "name": "External Rotation",
    "forkId": "External_Rotation_with_Band",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "bands",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Choke the band around a post. The band should be at the same height as your elbow. Stand with your left side to the band a couple of feet away.",
      "Grasp the end of the band with your right hand, and keep your elbow pressed firmly to your side. We recommend you hold a pad or foam roll in place with your elbow to keep it firmly in position.",
      "With your upper arm in position, your elbow should be flexed to 90 degrees with your hand reaching across the front of your torso. This will be your starting position.",
      "Execute the movement by rotating your arm in a backhand motion, keeping your elbow in place.",
      "Continue as far as you are able, pause, and then return to the starting position."
    ],
    "category": "strength",
    "images": [
      "External_Rotation_with_Band/0.jpg",
      "External_Rotation_with_Band/1.jpg"
    ]
  },
  {
    "name": "Bench Press - Medium Grip",
    "forkId": "Barbell_Bench_Press_-_Medium_Grip",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Lie back on a flat bench. Using a medium width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over you with your arms locked. This will be your starting position.",
      "From the starting position, breathe in and begin coming down slowly until the bar touches your middle chest.",
      "After a brief pause, push the bar back to the starting position as you breathe out. Focus on pushing the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position at the top of the motion, hold for a second and then start coming down slowly again. Tip: Ideally, lowering the weight should take about twice as long as raising it.",
      "Repeat the movement for the prescribed amount of repetitions.",
      "When you are done, place the bar back in the rack."
    ],
    "category": "strength",
    "images": [
      "Barbell_Bench_Press_-_Medium_Grip/0.jpg",
      "Barbell_Bench_Press_-_Medium_Grip/1.jpg"
    ]
  },
  {
    "name": "Hip Thrust",
    "forkId": "Barbell_Hip_Thrust",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "glutes"
    ],
    "secondaryMuscles": [
      "calves",
      "hamstrings"
    ],
    "instructions": [
      "Begin seated on the ground with a bench directly behind you. Have a loaded barbell over your legs. Using a fat bar or having a pad on the bar can greatly reduce the discomfort caused by this exercise.",
      "Roll the bar so that it is directly above your hips, and lean back against the bench so that your shoulder blades are near the top of it.",
      "Begin the movement by driving through your feet, extending your hips vertically through the bar. Your weight should be supported by your shoulder blades and your feet. Extend as far as possible, then reverse the motion to return to the starting position."
    ],
    "category": "powerlifting",
    "images": [
      "Barbell_Hip_Thrust/0.jpg",
      "Barbell_Hip_Thrust/1.jpg"
    ]
  },
  {
    "name": "Pullups",
    "forkId": "Pullups",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "lats"
    ],
    "secondaryMuscles": [
      "biceps",
      "middle back"
    ],
    "instructions": [
      "Grab the pull-up bar with the palms facing forward using the prescribed grip. Note on grips: For a wide grip, your hands need to be spaced out at a distance wider than your shoulder width. For a medium grip, your hands need to be spaced out at a distance equal to your shoulder width and for a close grip at a distance smaller than your shoulder width.",
      "As you have both arms extended in front of you holding the bar at the chosen grip width, bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out. This is your starting position.",
      "Pull your torso up until the bar touches your upper chest by drawing the shoulders and the upper arms down and back. Exhale as you perform this portion of the movement. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary as it moves through space and only the arms should move. The forearms should do no other work other than hold the bar.",
      "After a second on the contracted position, start to inhale and slowly lower your torso back to the starting position when your arms are fully extended and the lats are fully stretched.",
      "Repeat this motion for the prescribed amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Pullups/0.jpg",
      "Pullups/1.jpg"
    ]
  },
  {
    "name": "Rear Lunge",
    "forkId": "Dumbbell_Rear_Lunge",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Stand with your torso upright holding two dumbbells in your hands by your sides. This will be your starting position.",
      "Step backward with your right leg around two feet or so from the left foot and lower your upper body down, while keeping the torso upright and maintaining balance. Inhale as you go down. Tip: As in the other exercises, do not allow your knee to go forward beyond your toes as you come down, as this will put undue stress on the knee joint. Make sure that you keep your front shin perpendicular to the ground. Keep the torso upright during the lunge; flexible hip flexors are important. A long lunge emphasizes the Gluteus Maximus; a short lunge emphasizes Quadriceps.",
      "Push up and go back to the starting position as you exhale. Tip: Use the ball of your feet to push in order to accentuate the quadriceps. To focus on the glutes, press with your heels.",
      "Now repeat with the opposite leg."
    ],
    "category": "strength",
    "images": [
      "Dumbbell_Rear_Lunge/0.jpg",
      "Dumbbell_Rear_Lunge/1.jpg"
    ]
  },
  {
    "name": "Shoulder Press",
    "forkId": "Dumbbell_Shoulder_Press",
    "force": "push",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "triceps"
    ],
    "instructions": [
      "While holding a dumbbell in each hand, sit on a military press bench or utility bench that has back support. Place the dumbbells upright on top of your thighs.",
      "Now raise the dumbbells to shoulder height one at a time using your thighs to help propel them up into position.",
      "Make sure to rotate your wrists so that the palms of your hands are facing forward. This is your starting position.",
      "Now, exhale and push the dumbbells upward until they touch at the top.",
      "Then, after a brief pause at the top contracted position, slowly lower the weights back down to the starting position while inhaling.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Dumbbell_Shoulder_Press/0.jpg",
      "Dumbbell_Shoulder_Press/1.jpg"
    ]
  },
  {
    "name": "Bicep Curl",
    "forkId": "Dumbbell_Bicep_Curl",
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "biceps"
    ],
    "secondaryMuscles": [
      "forearms"
    ],
    "instructions": [
      "Stand up straight with a dumbbell in each hand at arm's length. Keep your elbows close to your torso and rotate the palms of your hands until they are facing forward. This will be your starting position.",
      "Now, keeping the upper arms stationary, exhale and curl the weights while contracting your biceps. Continue to raise the weights until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a brief pause as you squeeze your biceps.",
      "Then, inhale and slowly begin to lower the dumbbells back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Dumbbell_Bicep_Curl/0.jpg",
      "Dumbbell_Bicep_Curl/1.jpg"
    ]
  },
  {
    "name": "Face Pull",
    "forkId": "Face_Pull",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "cable",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "middle back"
    ],
    "instructions": [
      "Facing a high pulley with a rope or dual handles attached, pull the weight directly towards your face, separating your hands as you do so. Keep your upper arms parallel to the ground."
    ],
    "category": "strength",
    "images": [
      "Face_Pull/0.jpg",
      "Face_Pull/1.jpg"
    ]
  },
  {
    "name": "Deadlift",
    "forkId": "Barbell_Deadlift",
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "lower back"
    ],
    "secondaryMuscles": [
      "calves",
      "forearms",
      "glutes",
      "hamstrings",
      "lats",
      "middle back",
      "quadriceps",
      "traps"
    ],
    "instructions": [
      "Stand in front of a loaded barbell.",
      "While keeping the back as straight as possible, bend your knees, bend forward and grasp the bar using a medium (shoulder width) overhand grip. This will be the starting position of the exercise. Tip: If it is difficult to hold on to the bar with this grip, alternate your grip or use wrist straps.",
      "While holding the bar, start the lift by pushing with your legs while simultaneously getting your torso to the upright position as you breathe out. In the upright position, stick your chest out and contract the back by bringing the shoulder blades back. Think of how the soldiers in the military look when they are in standing in attention.",
      "Go back to the starting position by bending at the knees while simultaneously leaning the torso forward at the waist while keeping the back straight. When the weights on the bar touch the floor you are back at the starting position and ready to perform another repetition.",
      "Perform the amount of repetitions prescribed in the program."
    ],
    "category": "strength",
    "images": [
      "Barbell_Deadlift/0.jpg",
      "Barbell_Deadlift/1.jpg"
    ]
  },
  {
    "name": "Military Press",
    "forkId": "Standing_Military_Press",
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "triceps"
    ],
    "instructions": [
      "Start by placing a barbell that is about chest high on a squat rack. Once you have selected the weights, grab the barbell using a pronated (palms facing forward) grip. Make sure to grip the bar wider than shoulder width apart from each other.",
      "Slightly bend the knees and place the barbell on your collar bone. Lift the barbell up keeping it lying on your chest. Take a step back and position your feet shoulder width apart from each other.",
      "Once you pick up the barbell with the correct grip length, lift the bar up over your head by locking your arms. Hold at about shoulder level and slightly in front of your head. This is your starting position.",
      "Lower the bar down to the collarbone slowly as you inhale.",
      "Lift the bar back up to the starting position as you exhale.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Standing_Military_Press/0.jpg",
      "Standing_Military_Press/1.jpg"
    ]
  },
  {
    "name": "One-Arm Row",
    "forkId": "One-Arm_Dumbbell_Row",
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "biceps",
      "lats",
      "shoulders"
    ],
    "instructions": [
      "Choose a flat bench and place a dumbbell on each side of it.",
      "Place the right leg on top of the end of the bench, bend your torso forward from the waist until your upper body is parallel to the floor, and place your right hand on the other end of the bench for support.",
      "Use the left hand to pick up the dumbbell on the floor and hold the weight while keeping your lower back straight. The palm of the hand should be facing your torso. This will be your starting position.",
      "Pull the resistance straight up to the side of your chest, keeping your upper arm close to your side and keeping the torso stationary. Breathe out as you perform this step. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. Also, make sure that the force is performed with the back muscles and not the arms. Finally, the upper torso should remain stationary and only the arms should move. The forearms should do no other work except for holding the dumbbell; therefore do not try to pull the dumbbell up using the forearms.",
      "Lower the resistance straight down to the starting position. Breathe in as you perform this step.",
      "Repeat the movement for the specified amount of repetitions.",
      "Switch sides and repeat again with the other arm."
    ],
    "category": "strength",
    "images": [
      "One-Arm_Dumbbell_Row/0.jpg",
      "One-Arm_Dumbbell_Row/1.jpg"
    ]
  },
  {
    "name": "Single-Leg Romanian Deadlift",
    "forkId": null,
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "glutes",
      "lower back",
      "calves"
    ],
    "instructions": [
      "Stand tall holding dumbbells at your sides and shift your weight to one leg.",
      "Keep a soft bend in the working knee and hinge at the hips as the other leg reaches back.",
      "Lower until you feel hamstring tension while keeping your back neutral and hips square.",
      "Drive through the working foot to return to standing and repeat before switching sides."
    ],
    "category": "strength",
    "images": [
      "/exercise-images/single-leg-rdl.png"
    ]
  },
  {
    "name": "Incline Bench Press",
    "forkId": null,
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Set an incline bench around 30-45 degrees and lie back with a dumbbell in each hand.",
      "Start with elbows slightly below shoulder line and wrists stacked over elbows.",
      "Press the dumbbells up until your arms are straight without shrugging your shoulders.",
      "Lower with control until your upper arms reach roughly parallel to the floor."
    ],
    "category": "strength",
    "images": [
      "https://raw.githubusercontent.com/keenfann/free-exercise-db/main/exercises/Incline_Dumbbell_Press/0.jpg",
      "https://raw.githubusercontent.com/keenfann/free-exercise-db/main/exercises/Incline_Dumbbell_Press/1.jpg"
    ]
  },
  {
    "name": "Standing Calf Raise",
    "forkId": "Standing_Dumbbell_Calf_Raise",
    "force": "push",
    "level": "intermediate",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "calves"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Stand with your torso upright holding two dumbbells in your hands by your sides. Place the ball of the foot on a sturdy and stable wooden board (that is around 2-3 inches tall) while your heels extend off and touch the floor. This will be your starting position.",
      "With the toes pointing either straight (to hit all parts equally), inwards (for emphasis on the outer head) or outwards (for emphasis on the inner head), raise the heels off the floor as you exhale by contracting the calves. Hold the top contraction for a second.",
      "As you inhale, go back to the starting position by slowly lowering the heels.",
      "Repeat for the recommended amount of times."
    ],
    "category": "strength",
    "images": [
      "Standing_Dumbbell_Calf_Raise/0.jpg",
      "Standing_Dumbbell_Calf_Raise/1.jpg"
    ]
  },
  {
    "name": "Incline Curl",
    "forkId": "Incline_Dumbbell_Curl",
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "biceps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Sit back on an incline bench with a dumbbell in each hand held at arms length. Keep your elbows close to your torso and rotate the palms of your hands until they are facing forward. This will be your starting position.",
      "While holding the upper arm stationary, curl the weights forward while contracting the biceps as you breathe out. Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second.",
      "Slowly begin to bring the dumbbells back to starting position as your breathe in.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "images": [
      "Incline_Dumbbell_Curl/0.jpg",
      "Incline_Dumbbell_Curl/1.jpg"
    ]
  },
  {
    "name": "Farmer's Walk",
    "forkId": "Farmers_Walk",
    "force": null,
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "other",
    "primaryMuscles": [
      "forearms"
    ],
    "secondaryMuscles": [
      "abdominals",
      "glutes",
      "hamstrings",
      "lower back",
      "quadriceps",
      "traps"
    ],
    "instructions": [
      "There are various implements that can be used for the farmers walk. These can also be performed with heavy dumbbells or short bars if these implements aren't available. Begin by standing between the implements.",
      "After gripping the handles, lift them up by driving through your heels, keeping your back straight and your head up.",
      "Walk taking short, quick steps, and don't forget to breathe. Move for a given distance, typically 50-100 feet, as fast as possible."
    ],
    "category": "strongman",
    "images": [
      "Farmers_Walk/0.jpg",
      "Farmers_Walk/1.jpg"
    ]
  },
  {
    "name": "Ab Rollout",
    "forkId": null,
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "other",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [
      "lower back",
      "shoulders"
    ],
    "instructions": [
      "Kneel on a mat with hands on the ab wheel directly under your shoulders.",
      "Brace your core and roll forward slowly, keeping hips from sagging.",
      "Extend as far as you can while maintaining a neutral spine.",
      "Pull the wheel back by contracting your core to return to the start."
    ],
    "category": "strength",
    "images": [
      "https://raw.githubusercontent.com/keenfann/free-exercise-db/main/exercises/Ab_Roller/0.jpg",
      "https://raw.githubusercontent.com/keenfann/free-exercise-db/main/exercises/Ab_Roller/1.jpg"
    ]
  },
  {
    "name": "Pull Apart",
    "forkId": "Band_Pull_Apart",
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "bands",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "middle back",
      "traps"
    ],
    "instructions": [
      "Begin with your arms extended straight out in front of you, holding the band with both hands.",
      "Initiate the movement by performing a reverse fly motion, moving your hands out laterally to your sides.",
      "Keep your elbows extended as you perform the movement, bringing the band to your chest. Ensure that you keep your shoulders back during the exercise.",
      "Pause as you complete the movement, returning to the starting position under control."
    ],
    "category": "strength",
    "images": [
      "Band_Pull_Apart/0.jpg",
      "Band_Pull_Apart/1.jpg"
    ]
  },
  {
    "name": "Wall Slides",
    "forkId": null,
    "force": "static",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "body only",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "traps",
      "middle back"
    ],
    "instructions": [
      "Stand with your back and arms against a wall, elbows bent at 90 degrees.",
      "Keep ribs down and lower back neutral while sliding your arms overhead.",
      "Move only as far as you can without losing contact with the wall.",
      "Return slowly to the start and repeat with controlled tempo."
    ],
    "category": "stretching",
    "images": [
      "/exercise-images/wall-slides.png"
    ]
  },
  {
    "name": "Y-Raise",
    "forkId": null,
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "traps",
      "middle back"
    ],
    "instructions": [
      "Lie prone on an incline bench holding light dumbbells with thumbs up.",
      "Raise your arms in a Y path until they are in line with your torso.",
      "Focus on upward rotation of the shoulder blades, not shrugging.",
      "Lower under control and repeat for smooth, strict reps."
    ],
    "category": "strength",
    "images": [
      "/exercise-images/y-raise.png"
    ]
  },
  {
    "name": "Scapula Push-Up",
    "forkId": null,
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "body only",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "chest",
      "triceps"
    ],
    "instructions": [
      "Start in a high plank with elbows locked and body in a straight line.",
      "Without bending elbows, let your chest sink slightly by retracting shoulder blades.",
      "Press the floor away to protract shoulder blades until your upper back rounds slightly.",
      "Repeat controlled reps while keeping core and hips stable."
    ],
    "category": "strength",
    "images": [
      "/exercise-images/scapula-push-up.png"
    ]
  }
]
